/* програма призначенна для Обчисленя значення функції

*/
#include <stdio.h>//Підключення потрібних для роботи бібліотек
#include <math.h> 

int main() { 
    int a, b;// Вводимо змінні
    float x;

    printf("Введіть значення a: ");// Просимо юзера ввести потрібну інформацію
    scanf_s("%d", &a);

    printf("Введіть значення b: ");
    scanf_s("%d", &b);

    if (a - b * b < 0) {   // Перевірка, чи є вираз під коренем дійсним числом :
        printf("Результат не є дійсним числом\n");
        return 0;   /*Якщо значення під коренем від'ємне, то виводиться повідомлення про те
                     , що результат не є дійсним числом і програма завершується.*/
    }

    x = sqrt( a - b * b ) + sqrt( a * b ); //Обчислення значення Х
    
   

    printf("Значення функції x = %.2f\n", x);// Виводимо результат обчислення на екран юзера

    return 0;// кінець програми
}